In [1]:
import pandas as pd

In [2]:
my_Series = pd.Series([1,'cat',10.2,'dog'])
my_Series

0       1
1     cat
2    10.2
3     dog
dtype: object

In [3]:
my_Series[1]

'cat'

In [4]:
ages = pd.Series([20,53,68], index=['John', 'Allen', 'Mary'])
ages['John']

20

In [5]:
df = pd.DataFrame( {'user' : [1,2,3],
            'age' : [24,54,17],
            'sex' : ['F','F','M'],
            'occupation' : ['technician','musician','student']})

In [6]:
df

   age  occupation sex  user
0   24  technician   F     1
1   54    musician   F     2
2   17     student   M     3

In [13]:
df.set_index("user", inplace=True)

In [14]:
df

      age  occupation sex
user
1      24  technician   F
2      54    musician   F
3      17     student   M

In [15]:
df.index

Int64Index([1, 2, 3], dtype='int64', name='user')

In [17]:
df.shape

(3, 3)

In [18]:
df.columns

Index(['age', 'occupation', 'sex'], dtype='object')

In [19]:
df.describe()

             age
count   3.000000
mean   31.666667
std    19.655364
min    17.000000
25%    20.500000
50%    24.000000
75%    39.000000
max    54.000000

In [20]:
df['occupation']

user
1    technician
2      musician
3       student
Name: occupation, dtype: object

In [21]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.arange(9).reshape(3,3), columns=['a','b', 'c'])

In [22]:
df

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [23]:
df.drop(0, axis=0)

   a  b  c
1  3  4  5
2  6  7  8

In [24]:
df.drop([0,2], axis=0)

   a  b  c
1  3  4  5

In [25]:
df.drop(['b','c'], axis=1)

   a
0  0
1  3
2  6

In [26]:
df.a + df.b

0     1
1     7
2    13
dtype: int32

In [27]:
df

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [28]:
df.a.add(df.b)

0     1
1     7
2    13
dtype: int32

In [29]:
df.add(df.loc[0:1,:])

     a    b     c
0  0.0  2.0   4.0
1  6.0  8.0  10.0
2  NaN  NaN   NaN

In [30]:
df1= pd.DataFrame([['Mark', 50], ['Kate', 46]],
                 columns=['name', 'age'])
df2 = pd.DataFrame([['Jon', 3], ['David', 4]],
                columns=['name', 'age'])

In [31]:
pd.concat([df1,df2])

    name  age
0   Mark   50
1   Kate   46
0    Jon    3
1  David    4

In [32]:
df3 = pd.DataFrame(['writer', 'journalist'], columns=['occupation'])

In [33]:
pd.concat([df1, df3], axis=1)

   name  age  occupation
0  Mark   50      writer
1  Kate   46  journalist

In [34]:
df= pd.DataFrame( {'user' : [1,2,3],
            'age' : [24,54,17],
            'sex' : ['F','F','M'],
            'occupation' : ['technician','musician','student']})
df

   age  occupation sex  user
0   24  technician   F     1
1   54    musician   F     2
2   17     student   M     3

In [35]:
df[df.sex=='F']

   age  occupation sex  user
0   24  technician   F     1
1   54    musician   F     2

In [36]:
df[df.sex=='F'].sex

0    F
1    F
Name: sex, dtype: object

In [39]:
df = pd.DataFrame( {'user' : [1,2,3], 'age' : [24,54,17], 'sex' : ['F','F','M'], 'occupation' : ['technician','musician','student']})

In [40]:
df2 = df.loc[df.sex=='F']

In [43]:
df2.loc[0:1,'sex']='Female'

C:\Users\eric\Anaconda2\envs\exts-ida\lib\site-packages\pandas\core\indexing.py:517: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [45]:
df = pd.DataFrame( {'user' : [1,2,3], 'age' : [24,54,17],  'sex' : ['F','F','M'], 'occupation' : ['technician','musician','student']})

In [46]:
df['sex'] = df.sex.map({'F':'Female', 'M':'Male'})
df

   age  occupation     sex  user
0   24  technician  Female     1
1   54    musician  Female     2
2   17     student    Male     3

In [47]:
def dog_years(x):
    return x // 7

In [48]:
df['age_dog_years'] = df['age'].apply(dog_years)
df

   age  occupation     sex  user  age_dog_years
0   24  technician  Female     1              3
1   54    musician  Female     2              7
2   17     student    Male     3              2

In [49]:
df2 = pd.DataFrame(np.arange(9).reshape(3,3), columns=['a','b', 'c'])

In [50]:
def my_sum(x):
    return sum(x)

In [51]:
df2.apply(my_sum, axis=0)

a     9
b    12
c    15
dtype: int64

In [52]:
df2.apply(my_sum, axis=1)

0     3
1    12
2    21
dtype: int64

In [53]:
df2

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [54]:
def add_two(x):
    return x+2

In [55]:
df2.applymap(add_two)

   a  b   c
0  2  3   4
1  5  6   7
2  8  9  10

In [57]:
df = pd.DataFrame({'A':[3,6,1,12,3],'B':[0,0,7,5,6],'C':[10,4,5,8,2]})
df

    A  B   C
0   3  0  10
1   6  0   4
2   1  7   5
3  12  5   8
4   3  6   2

In [58]:
df.sort_index(ascending=False)

    A  B   C
4   3  6   2
3  12  5   8
2   1  7   5
1   6  0   4
0   3  0  10

In [59]:
df.sort_index(ascending=False, axis=1)

    C  B   A
0  10  0   3
1   4  0   6
2   5  7   1
3   8  5  12
4   2  6   3

In [60]:
df.A.sort_values()

2     1
0     3
4     3
1     6
3    12
Name: A, dtype: int64

In [61]:
df = pd.DataFrame({
       'A' : ['dog', 'cat', 'dog', 'cat', 'dog', 'cat', 'dog', 'dog'],
       'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
       'C' : np.random.randint(10, size=8)})

In [62]:
df.C.mean()

6.0

In [63]:
df.groupby('A').C.mean()

A
cat    6
dog    6
Name: C, dtype: int32

In [64]:
df

     A      B  C
0  dog    one  8
1  cat    one  9
2  dog    two  5
3  cat  three  6
4  dog    two  9
5  cat    two  3
6  dog    one  1
7  dog  three  7

In [65]:
df = pd.DataFrame(np.random.randint(10, size=(3, 3)), index=['a', 'c', 'e'], columns=['A', 'B', 'C'])

In [66]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f'])

In [67]:
df2

     A    B    C
a  2.0  3.0  3.0
b  NaN  NaN  NaN
c  6.0  4.0  6.0
d  NaN  NaN  NaN
e  4.0  1.0  6.0
f  NaN  NaN  NaN

In [68]:
df

   A  B  C
a  2  3  3
c  6  4  6
e  4  1  6

In [69]:
df2.isnull()

       A      B      C
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f   True   True   True

In [70]:
df2.isnull().sum()

A    3
B    3
C    3
dtype: int64

In [71]:
df2.isnull().sum(axis=1)

a    0
b    3
c    0
d    3
e    0
f    3
dtype: int64

In [72]:
df2[df2.A.isnull()]

    A   B   C
b NaN NaN NaN
d NaN NaN NaN
f NaN NaN NaN

In [74]:
df2[~df2.A.isnull()]

     A    B    C
a  2.0  3.0  3.0
c  6.0  4.0  6.0
e  4.0  1.0  6.0

In [75]:
df2.dropna()

     A    B    C
a  2.0  3.0  3.0
c  6.0  4.0  6.0
e  4.0  1.0  6.0

In [38]:
df

   age  occupation sex  user
0   24  technician   F     1
1   54    musician   F     2
2   17     student   M     3